//TODO: edit the data 
export const metadata = {
    title: ' الاسئلة الشائعة',
    description: 'اسئلة شائعة حول الجامعات السورية الخاصة  ',
}
const content = `  فيما يلي بعض الاسئلة الشائعة والتي قد ترادوكم والاجوبة عنها : `;


const Ques = [
    {
        id: 1,
        ques: "كيف يمكنني التسجيل في الجامعة الخاصة؟",
        answer: "إذا كان الاختصاص طبيًا، يجب التسجيل من خلال مفاضلة الدولة المركزية. أما إذا كان الاختصاص غير طبي، فيجب التسجيل مباشرة في الجامعة الخاصة."
    },
    {
        id: 2,
        ques: "ما هي الوثائق المطلوبة للتسجيل في الجامعة الخاصة؟",
        answer: "1. صورة مصدقة من شهادة الدراسة الثانوية. 2. صورة عن الهوية الشخصية أو جواز السفر. 3. صورة شخصية حديثة بالألوان وبقياس 3×4. 4. طلب مفاضلة للتسجيل. 5. تسديد رسم المفاضلة."
    },
    {
        id: 3,
        ques: "هل يمكنني التسجيل في الجامعات الحكومية بشهادة ثانوية غير سورية؟",
        answer: "نعم، ولكن يتوجب عليك تعديل الشهادة ثم التسجيل في المفاضلة."
    },
    {
        id: 4,
        ques: "ما هي كلفة دراسة الطب في سوريا؟",
        answer: "تكلفة الدراسة تختلف حسب الجنسية، حيث تصل لحوالي 5 ملايين ليرة سورية للفصل للطلاب السوريين، و2000 دولار أمريكي لغير المقيمين، و4000 دولار أمريكي للطلاب غير السوريين."
    },
    {
        id: 5,
        ques: "هل الدفع بالليرة السورية أم بالدولار الأمريكي؟",
        answer: "الطلاب السوريون يدفعون بالليرة السورية، بينما غير السوريين يدفعون بالدولار الأمريكي."
    },
    {
        id: 6,
        ques: "ما هو نظام الساعات الدراسية في الجامعات؟",
        answer: "نظام الساعات يعتمد على عدد الساعات التي يدرسها الطالب في الفصل، حيث يمكن أن تكون 18 ساعة إذا كانت كل مادة 3 ساعات."
    },
    {
        id: 7,
        ques: "كيف يمكنني الذهاب يوميًا للجامعة الخاصة؟",
        answer: "يمكنك استخدام النقل الجامعي، أو نقل الشركات الخاصة، أو الذهاب بسيارتك الخاصة، أو من خلال الكراجات الحكومية، أو الذهاب مع الأصدقاء."
    },
    {
        id: 8,
        ques: "ما هو وضع المواصلات في الجامعات الخاصة؟",
        answer: "يمكنك الوصول للجامعة من خلال خيارات النقل المتوفرة مثل النقل الجامعي، نقل الشركات الخاصة، أو الكراجات الحكومية."
    },
    {
        id: 9,
        ques: "هل يمكنني التسجيل بشهادة ثانوية قديمة؟",
        answer: "نعم، يمكنك التسجيل بغض النظر عن تاريخ الشهادة."
    },
    {
        id: 10,
        ques: "هل شهادة الجامعة الخاصة معترف بها خارج سوريا؟",
        answer: "نعم، معترف بها في العديد من الدول."
    },
    {
        id: 11,
        ques: "هل تنقبل الشهادة غير السورية في الجامعات الخاصة في سوريا؟",
        answer: "لا، ولكن يمكن معادلتها للشهادة السورية."
    },
    {
        id: 12,
        ques: "هل يوجد سكن جامعي للجامعات الخاصة؟",
        answer: "نعم، ولكن ليس جميع الجامعات توفر سكن طلابي."
    },
    {
        id: 13,
        ques: "ما هي تكاليف السكن الجامعي؟",
        answer: "تكاليف السكن تختلف حسب الجامعة والموقع، وعادةً ما تكون أقل من تكاليف الإيجار في السوق."
    },
    {
        id: 14,
        ques: "ما هي مفاضلة ملئ الشواغر وكيف يمكنني التقدم إليها؟",
        answer: "مفاضلة ملئ الشواغر تتيح للطلاب التقدم للقبول في الجامعات الخاصة، وتكون الأولوية حسب المجموع الأعلى."
    },
    {
        id: 15,
        ques: "ما هي آلية قبول الطلاب في مفاضلة ملئ الجامعات الخاصة؟",
        answer: "يتم قبول الطلاب بناءً على المجموع الأعلى في الشهادة الثانوية."
    },
    {
        id: 16,
        ques: "كيف أسجل في الطب في الجامعة الخاصة في سوريا؟",
        answer: "يجب عليك تقديم الوثائق المطلوبة والتسجيل في مفاضلة الجامعة الخاصة."
    },
    {
        id: 17,
        ques: "ما هي التخصصات الدراسية في الجامعات الخاصة؟",
        answer: "تتضمن التخصصات الطبية، الهندسية، العلوم الإنسانية، والعلوم الإدارية وغيرها."
    },
    {
        id: 18,
        ques: "ما هي مدة الدراسة في الجامعات الخاصة؟",
        answer: "مدة الدراسة تختلف حسب التخصص، ولكن عادةً ما تكون بين 4 إلى 6 سنوات."
    },
    {
        id: 19,
        ques: "معدلات قبول الطلاب العرب في الجامعات الخاصة؟",
        answer: "معدلات القبول تختلف حسب الجامعة والتخصص، وعادةً ما تكون متطلباتها مشابهة للطلاب السوريين."
    },
    {
        id: 20,
        ques: "هل يوجد ماجستير في الجامعات الخاصة؟",
        answer: "نعم، العديد من الجامعات الخاصة تقدم برامج دراسات عليا مثل الماجستير."
    },
    {
        id: 21,
        ques: "هل الجامعة الخاصة معترف بها؟",
        answer: "نعم، الجامعات الخاصة معترف بها في العديد من الدول."
    },
    {
        id: 22,
        ques: "شهادة الثانوية قديمة جدًا من عام 1990، هل تقبل في الجامعات الخاصة؟",
        answer: "نعم، يمكنك التسجيل بغض النظر عن تاريخ الشهادة."
    },
    {
        id: 23,
        ques: "ما هي ساعات العمل للتسجيل في الجامعات الخاصة؟",
        answer: "يمكنك فحص الموقع الإلكتروني للجامعة للحصول على تفاصيل ساعات العمل."
    },
    {
        id: 24,
        ques: "هل يزيد قسط الجامعة؟",
        answer: "نعم، قد يزيد قسط الجامعة سنويًا حسب الظروف الاقتصادية والسياسات الداخلية."
    },
    // {
    //     id: 25,
    //     ques: "ما هي أفضل جامعة باختصاص ***** في سوريا؟",
    //     answer: "قريبـــــــــــاً."
    // },
    // {
    //     id: 26,
    //     ques: "ما هي أقوى جامعة خاصة باختصاص **** في سوريا؟",
    //     answer: "قريبـــــــــــاً."
    // }
];

const FAQ = () => {
    return (
        <section className=" bg">


            {/* -------------Header------------- */}
            <div className="lg:px-28 lg:py-14 p-10  lg:text-2xl text-base  ">
                <div>
                    <h1 className=" text-warning my-1 font-semibold ">الإسئلة الشائعة :</h1>
                    <h3 className=" font-medium leading-loose text-justify">{content}</h3>
                </div>
            </div>

            {/* -------------Header ends------------- */}




            <div className=" lg:px-28 lg:py-0 p-10 text-base      ">
                {Ques.map(ques => <div
                    className="collapse bg-secondary lg:my-5 my-2"
                    key={ques.id}>
                    <input type="checkbox" />
                    <div className="collapse-title lg:text-xl font-medium ">
                        {`${ques.id}.  ${ques.ques} ؟`}
                    </div>
                    <div className="collapse-content">
                        <p className="text-warning">{ques.answer}</p>
                    </div>
                </div>)}

            </div>





        </section>
    )
}

export default FAQ
