
const About = ({ id }) => {
    const about = [
        {
            id: 15,
            data: `جامعة الشام الخاصة هي إحدى الجامعات الخاصة في سوريا. تأسست لتقديم التعليم العالي وتطوير المعرفة في مجموعة متنوعة من التخصصات الأكاديمية. تهدف هذه الجامعة إلى توفير بيئة تعليمية جودة للطلاب وتقديم برامج تعليمية تلبي احتياجات سوق العمل.

تقدم جامعة الشام الخاصة برامج دراسات عليا وبكالوريوس في مجموعة متنوعة من التخصصات. يمكن للطلاب الاطلاع على موقع الجامعة أو التواصل معها مباشرة للحصول على معلومات حول البرامج المتاحة وشروط القبول والأنشطة الجامعية الأخرى.
`,
            name: 'ASPU',
            nameAr: 'جامعة الشام الخاصة'
        },
        {
            id: 1,
            data: `الجامعة العربية الدولية هي جامعة خاصة في سوريا. تأسست هذه الجامعة لتقديم التعليم العالي في مجموعة متنوعة من التخصصات الأكاديمية. تسعى الجامعة إلى تقديم برامج تعليمية عالية الجودة وتوفير بيئة تعليمية مناسبة للطلاب. تشمل التخصصات المتاحة في الجامعة العربية الدولية مجموعة واسعة من مجالات الدراسات العليا والبكالوريوس. يجب على الطلاب الاطلاع على موقع الجامعة لمزيد من المعلومات حول البرامج المتاحة ومتطلبات القبول.
`,
            name: 'AIU',
            nameAr: 'الجامعة العربية الدولية'
        },
        {
            id: 2,
            data: `جامعة الشهباء الخاصة هي إحدى الجامعات الخاصة في سوريا. تهدف هذه الجامعة إلى تقديم التعليم العالي وتعزيز البحث العلمي في مجموعة متنوعة من التخصصات الأكاديمية.

تقدم جامعة الشهباء الخاصة برامج دراسات عليا وبكالوريوس في مجموعة متنوعة من التخصصات الأكاديمية. تسعى الجامعة إلى توفير بيئة تعليمية تشجع على التفكير النقدي وتطوير المهارات اللازمة لنجاح الطلاب في مساراتهم المهنية.
`,
            name: 'SU',
            nameAr: 'جامعة الشهباء الخاصة'
        },
        {
            id: 3,
            data: `جامعة الرشيد الخاصة للعلوم والتكنولوجيا هي إحدى الجامعات الخاصة في سوريا. تسعى هذه الجامعة إلى تقديم التعليم العالي وتعزيز البحث العلمي في مجموعة متنوعة من التخصصات الأكاديمية والتكنولوجية.

تقدم جامعة الرشيد الخاصة برامج دراسات عليا وبكالوريوس في مجموعة متنوعة من التخصصات. تهدف الجامعة إلى تزويد الطلاب بالمعرفة والمهارات اللازمة لمواكبة التقدم التكنولوجي والاقتصادي والمساهمة في تطوير المجتمع.`,
            name: 'RU',
            nameAr: 'جامعة الرشيد الخاصة'
        },
        {
            id: 4,
            data: `جامعة قاسيون الخاصة هي إحدى الجامعات الخاصة في سوريا. تأسست لتقديم التعليم العالي في مجموعة متنوعة من التخصصات الأكاديمية. تهدف هذه الجامعة إلى توفير بيئة تعليمية جودة للطلاب وتقديم برامج تعليمية تلبي احتياجات السوق المحلي والإقليمي.

تقدم جامعة قاسيون الخاصة برامج دراسات عليا وبكالوريوس في مجموعة متنوعة من التخصصات الأكاديمية. يمكن للطلاب الاطلاع على موقع الجامعة أو التواصل معها مباشرة للحصول على مزيد من المعلومات حول البرامج المتاحة ومتطلبات القبول والأنشطة الجامعية الأخرى.`,
            name: 'QPU',
            nameAr: 'جامعة قاسيون الخاصة'
        },
        {
            id: 5,
            data: `الجامعة العربية للعلوم والتكنولوجيا هي جامعة خاصة تقع في سوريا. تهدف هذه الجامعة إلى تقديم التعليم العالي وتعزيز البحث العلمي وتطوير المهارات في مجموعة متنوعة من التخصصات الأكاديمية والتكنولوجية.

تقدم الجامعة العربية للعلوم والتكنولوجيا برامج دراسات عليا وبكالوريوس في مجموعة متنوعة من التخصصات. تسعى الجامعة إلى تزويد الطلاب بالمعرفة والمهارات الضرورية للنجاح في مجتمع المعرفة الحديث والمساهمة في التطور التكنولوجي والاقتصادي.`,
            name: 'AUST',
            nameAr: 'الجامعة العربية للعلوم والتكنولوجيا'
        },
        {
            id: 6,
            data: `جامعة قرطبة الخاصة هي إحدى الجامعات الخاصة في سوريا. تأسست لتقديم التعليم العالي في مجموعة متنوعة من التخصصات الأكاديمية. تهدف هذه الجامعة إلى توفير بيئة تعليمية جودة للطلاب وتقديم برامج تعليمية تلبي احتياجات السوق المحلي والإقليمي.

تقدم جامعة قرطبة الخاصة برامج دراسات عليا وبكالوريوس في مجموعة متنوعة من التخصصات الأكاديمية. يمكن للطلاب الاطلاع على موقع الجامعة أو التواصل معها مباشرة للحصول على مزيد من المعلومات حول البرامج المتاحة ومتطلبات القبول والأنشطة الجامعية الأخرى.`,
            name: 'CPU',
            nameAr: 'جامعة قرطبة الخاصة'
        },
        {
            id: 7,
            data: `بدأ الإعداد لتأسيس جامعة إيبلا الخاصة في العام 2004 من قبل مجموعة من الأساتذة في جامعة حلب. منطلقين من عقيدة موضوعية تحاكي الهدف التربوي واضعين بعين الاعتبار أن التنمية الحقيقية لا تتحقق إلا من خلال تربية وتأهيل أجيال الشباب للحياة العصرية علمياً ومهنياً.`,
            name: 'EBLA',
            nameAr: 'جامعة إيبلا الخاصة'
        },
        {
            id: 8,
            data: `جامعة أنطاكية السورية الخاصة هي إحدى الجامعات الخاصة في سوريا. تأسست لتقديم التعليم العالي في مجموعة متنوعة من التخصصات الأكاديمية. تهدف هذه الجامعة إلى توفير بيئة تعليمية جودة للطلاب وتقديم برامج تعليمية تلبي احتياجات السوق المحلي والإقليمي.

تقدم جامعة أنطاكية السورية الخاصة برامج دراسات عليا وبكالوريوس في مجموعة متنوعة من التخصصات الأكاديمية. يمكن للطلاب الاطلاع على موقع الجامعة أو التواصل معها مباشرة للحصول على مزيد من المعلومات حول البرامج المتاحة ومتطلبات القبول والأنشطة الجامعية الأخرى.`,
            name: 'ASU',
            nameAr: 'جامعة أنطاكية السورية الخاصة'
        },
        {
            id: 9,
            data: ` جامعة الاتحاد الخاصة هي جامعة خاصة في سوريا. تأسست لتقديم التعليم العالي في مجموعة متنوعة من التخصصات الأكاديمية. تهدف هذه الجامعة إلى توفير بيئة تعليمية جودة للطلاب وتقديم برامج تعليمية تلبي احتياجات السوق المحلي والإقليمي.

تقدم جامعة الاتحاد الخاصة برامج دراسات عليا وبكالوريوس في مجموعة متنوعة من التخصصات الأكاديمية. يمكن للطلاب الاطلاع على موقع الجامعة أو التواصل معها مباشرة للحصول على مزيد من المعلومات حول البرامج المتاحة ومتطلبات القبول والأنشطة الجامعية الأخرى.`,
            name: 'IPU',
            nameAr: 'جامعة الاتحاد الخاصة'
        },
        {
            id: 10,
            data: `جامعة اليرموك الخاصة هي إحدى الجامعات الخاصة في سوريا. تأسست لتقديم التعليم العالي في مجموعة متنوعة من التخصصات الأكاديمية. تسعى الجامعة إلى توفير بيئة تعليمية جودة للطلاب وتقديم برامج تعليمية تلبي احتياجات السوق المحلي والإقليمي.

تقدم جامعة اليرموك الخاصة برامج دراسات عليا وبكالوريوس في مجموعة متنوعة من التخصصات الأكاديمية. يمكن للطلاب الاطلاع على موقع الجامعة أو التواصل معها مباشرة للحصول على مزيد من المعلومات حول البرامج المتاحة ومتطلبات القبول والأنشطة الجامعية الأخرى.`,
            name: 'YPU',
            nameAr: 'جامعة اليرموك الخاصة'
        },
        {
            id: 11,
            data: `جامعة الوادي الدولية هي جامعة خاصة في سوريا. تسعى هذه الجامعة إلى تقديم التعليم العالي في مجموعة متنوعة من التخصصات الأكاديمية. تهدف إلى توفير بيئة تعليمية جودة وتطوير المعرفة والمهارات للطلاب.

تقدم جامعة الوادي الدولية برامج دراسات عليا وبكالوريوس في مجموعة متنوعة من التخصصات. يمكن للطلاب الاطلاع على موقع الجامعة لمزيد من المعلومات حول البرامج المتاحة ومتطلبات القبول والأنشطة الجامعية الأخرى.
`,
            name: 'WIU',
            nameAr: 'جامعة الوادي الدولية الخاصة'
        },
        {
            id: 12,
            data: `جامعة الحواش الخاصة في سوريا تأسست عام 2007 ومعترف بها من قبل وزارة التعليم العالي. عضو في منظمات دولية معروفة. موقعها في منطقة هادئة بالقرب من الحدود اللبنانية. توفير مرافق حديثة ودعم أكاديمي شامل مع هيئة تدريس مؤهلة. الحرم الجامعي يحتوي على مباني أكاديمية جميلة ومكتبات متقدمة ودور سكنية عصرية. توفر بيئة تعليمية مشجعة لتطوير المهارات وتكوين صداقات.`,
            name: 'HPU',
            nameAr: 'جامعة الحواش الخاص'
        },
        {
            id: 13,
            data: `الجامعة الوطنية الخاصة هي جامعة خاصة في سوريا. تأسست لتقديم التعليم العالي في مجموعة متنوعة من التخصصات الأكاديمية. تهدف هذه الجامعة إلى توفير بيئة تعليمية جودة للطلاب وتقديم برامج تعليمية تلبي احتياجات السوق المحلي والإقليمي.

تقدم الجامعة الوطنية الخاصة برامج دراسات عليا وبكالوريوس في مجموعة متنوعة من التخصصات. يمكن للطلاب الاطلاع على موقع الجامعة لمزيد من المعلومات حول البرامج المتاحة ومتطلبات القبول والأنشطة الجامعية الأخرى.
`,
            name: 'WPU',
            nameAr: 'الجامعة الوطنية الخاصة'
        },
        {
            id: 14,
            data: `جامعة المنارة هي جامعة خاصة في سوريا. تهدف هذه الجامعة إلى تقديم التعليم العالي في مجموعة متنوعة من التخصصات الأكاديمية. تسعى الجامعة إلى تقديم برامج تعليمية عالية الجودة وتوفير بيئة تعليمية مناسبة للطلاب.

تشمل التخصصات المتاحة في جامعة المنارة مجموعة متنوعة من مجالات الدراسات العليا والبكالوريوس. يمكن للطلاب الاطلاع على موقع الجامعة لمزيد من المعلومات حول البرامج المتاحة ومتطلبات القبول والأنشطة الجامعية الأخرى.`,
            name: 'Manara',
            nameAr: 'جامعة المنارة الخاصة'
        },
        {
            id: 16,
            data: `جامعة الجزيرة الخاصة بدير الزور هي جامعة سورية خاصة مقرها الحالي اوتستراد (دمشق - درعا) غباغب.

أُنشأت عام 2007 بهدف تقديم خدمات التعليم الجامعي ومابعد الجامعي للمنطقة الشرقية من سوريا. تضم كليات للهندسة والإدارة بأقسام متعددة لكليهما. يقع الحرم الجامعي الدائم قرب المدخل الشمالي لمدينة دير الزور على الطريق الواصل بين دير الزور وحلب.`,
            name: 'JPU',
            nameAr: 'جامعة الجزيرة الخاصة'
        },
        {
            id: 17,
            data: `الجامعة الدولية الخاصة للعلوم والتكنولوجيا هي جامعة خاصة في سوريا متخصصة في مجالات العلوم والتكنولوجيا. تم تأسيس هذه الجامعة لتقديم برامج تعليمية عالية الجودة في مجموعة متنوعة من التخصصات العلمية والتكنولوجية.

تهدف الجامعة الدولية الخاصة للعلوم والتكنولوجيا إلى تطوير المعرفة والبحث العلمي في مجالات متعددة وتزويد الطلاب بالمهارات اللازمة لمواكبة التقدم التكنولوجي وتحقيق النجاح في مجتمعات المعرفة الحديثة.
`,
            name: 'IUST',
            nameAr: 'الجامعة الدولية الخاصة للعلوم والتكنولوجيا'
        },
        {
            id: 18,
            data: `جامعة القلمون الخاصة هي جامعة خاصة في سوريا. تأسست بهدف تقديم التعليم العالي وتطوير المعرفة في مجموعة متنوعة من التخصصات الأكاديمية. تسعى الجامعة إلى توفير بيئة تعليمية تشجع على التفكير والبحث وتطوير المهارات اللازمة للنجاح في مجالات متعددة.

تقدم جامعة القلمون الخاصة برامج دراسات عليا وبكالوريوس في مجموعة متنوعة من التخصصات الأكاديمية. يمكن للطلاب الاطلاع على موقع الجامعة للحصول على معلومات حول البرامج المتاحة وشروط القبول والأنشطة الجامعية الأخرى.

`,
            name: 'UOK',
            nameAr: 'جامعة القلمون الخاصة'
        },
        {
            id: 19,
            data: `الجامعة السورية الخاصة هي إحدى الجامعات الخاصة في سوريا. تأسست لتقديم التعليم العالي في مجموعة متنوعة من التخصصات الأكاديمية. تهدف الجامعة السورية الخاصة إلى توفير بيئة تعليمية جودة للطلاب وتقديم برامج تعليمية تلبي احتياجات سوق العمل المحلي والإقليمي.

تشمل التخصصات المتاحة في الجامعة السورية الخاصة مجموعة متنوعة من مجالات الدراسات العليا والبكالوريوس. يجب على الطلاب المهتمين بالالتحاق بالجامعة السورية الخاصة الاطلاع على موقع الجامعة للحصول على معلومات حول البرامج المتاحة ومتطلبات القبول.
`,
            name: 'SPU',
            nameAr: 'الجامعة السورية الخاصة'
        },
        {
            id: 20,
            data: `جامعة الأندلس للعلوم الطبية هي جامعة خاصة في سوريا تركز بشكل رئيسي على مجال العلوم الطبية والصحية. تهدف هذه الجامعة إلى تقديم تعليم ذو جودة عالية في مجالات الطب والعلوم الصحية المتعلقة. تقدم الجامعة برامج دراسات عليا وبكالوريوس في مجموعة متنوعة من التخصصات الطبية والصحية.

تسعى جامعة الأندلس لتطوير المعرفة الطبية والعلمية وتزويد الطلاب بالمهارات والمعرفة اللازمة لممارسة مهن طبية وصحية ناجحة. إنها جامعة تلتزم بمعايير الجودة والتميز في التعليم والبحث العلمي.`,
            name: 'AMU',
            nameAr: 'جامعة الأندلس الخاصة'
        }

    ]
    return (
        < >

            {about.map(uni => {
                if (uni.id === id) {
                    return <div className=" lg:mx-10 lg:text-2xl py-3 " key={uni.id}>
                        <h2 className="font-bold">لمحة سريعة :</h2>
                        <p className="text-base  tracking-wide text-justify">{uni.data}</p>
                    </div>
                }
            })
            }



        </ >
    )
}

export default About


/**const universities = [
  {
    id: 1,
    name: "الجامعة العربية الدولية",
    data: ``لجامعة العربية الدولية هي جامعة خاصة في سوريا. تأسست هذه الجامعة لتقديم التعليم العالي في مجموعة متنوعة من التخصصات الأكاديمية. تسعى الجامعة إلى تقديم برامج تعليمية عالية الجودة وتوفير بيئة تعليمية مناسبة للطلاب. تشمل التخصصات المتاحة في الجامعة العربية الدولية مجموعة واسعة من مجالات الدراسات العليا والبكالوريوس. يجب على الطلاب الاطلاع على موقع الجامعة لمزيد من المعلومات حول البرامج المتاحة ومتطلبات القبول.",
  },
  {
    id: 2,
    name: "جامعة الأندلس للعلوم الطبية",
    data: "جامعة الأندلس للعلوم الطبية هي جامعة خاصة في سوريا تركز بشكل رئيسي على مجال العلوم الطبية والصحية. تهدف هذه الجامعة إلى تقديم تعليم ذو جودة عالية في مجالات الطب والعلوم الصحية المتعلقة. تقدم الجامعة برامج دراسات عليا وبكالوريوس في مجموعة متنوعة من التخصصات الطبية والصحية.

تسعى جامعة الأندلس لتطوير المعرفة الطبية والعلمية وتزويد الطلاب بالمهارات والمعرفة اللازمة لممارسة مهن طبية وصحية ناجحة. إنها جامعة تلتزم بمعايير الجودة والتميز في التعليم والبحث العلمي.",
  },
  ...
  {
    id: 19,
    name: "جامعة الشهباء الخاصة",
    data: "جامعة الشهباء الخاصة هي إحدى الجامعات الخاصة في سوريا. تهدف هذه الجامعة إلى تقديم التعليم العالي وتعزيز البحث العلمي في مجموعة متنوعة من التخصصات الأكاديمية. تقدم جامعة الشهباء الخاصة برامج دراسات عليا وبكالوريوس في مجموعة متنوعة من التخصصات الأكاديمية. تسعى الجامعة إلى توفير بيئة تعليمية تشجع على التفكير النقدي وتطوير المهارات اللازمة لنجاح الطلاب في مساراتهم المهنية.",
  },
];
 */